#   -*- mode: org; fill-column: 60 -*-
#+TITLE: Egg Mobile
#+STARTUP: showall
#+PROPERTY: filename
  :PROPERTIES:
  :Name: /home/deerpig/proj/chenla/projects/proj-egg-mobile.org
  :Created: 2017-03-20T14:36@Prek Leap (11.642600N-104.919210W)
  :ID: 81eacc8c-d818-4b4d-940a-fc3d10ed9fd7
  :URL:
  :END:
#+INCLUDE: ./inc/head.org
#+INCLUDE: ./inc/macros.org

{{{breadcrumbs}}}

#+HTML: <div class="outline-2" id="meta">
| *Author*  | Brad Collins <brad@chenla.org>             |
| *Date*    | {{{time(%Y-%m-%d %H:%M:%S)}}}              |
#+HTML: </div>

#+TOC: headlines 4


* Status of This Document

The latest version of this document is: src_sh[:results value]{git describe --abbrev=0 --tags}

#+HTML: <div class="notice notice-info">
*Changes since the last version*

#+HTML: <ul>

#+BEGIN_SRC sh :exports results :results value html :var TAG="v00.01.02"
  RES='git log $TAG...HEAD --pretty="<li>%s</li>\n" -- (file-name-nondirectory (buffer-file-name))'
  if [ -z $RES ]; then
    RES="<li>no changes</li>"
  fi
  echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
<li>no changes</li>
#+END_EXPORT

#+HTML: </ul>
#+HTML: </div>

* Introduction

Based on Joel Salatin's Egg Mobile.

 - [[https://en.wikipedia.org/wiki/Joel_Salatin][Joel Salatin]] | Wikipedia
 - [[http://permaculturenews.org/2010/09/03/how-to-make-an-egg-mobile/][How to Make an Egg Mobile]] | The Permaculture Research Institute
 - [[https://www.milkwood.net/2013/01/03/enter-the-egg-mobile-start-with-what-youve-got/][Enter the egg mobile (start with what you've got)]] | Milkwood
 - 

Our version must have very good air-flow and shading/and rain shelter.

  - clean (hose clean)
  - cool
  - dry (during rainy season)

I tend to think we will need a double-roof -- perhaps a vinyl top roof
and a metal sub-roof?
